# GetDrivingCurve Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SweptProfile..::..GetDrivingCurve Method
SweptProfile Class See Also
---
Provides access to the curve that dictates the path of the swept profile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public Curve GetDrivingCurve()
```

Visual Basic
---
```text
Public Function GetDrivingCurve As Curve
```

Visual C++
---
```text
public:
Curve^ GetDrivingCurve()
```

# ### Return Value
A curve that defines the path of the swept profile.
# Remarks
The profile may not be swept the entire length of this curve. One should check the set back properties on this object to locate how far the actual sweep is from the ends of the curve.
# See Also
SweptProfile Class
Autodesk.Revit.DB Namespace